-- 8 исполнителей
insert into 
	artist(name_artist)
values
	('oximiron'),
	('zemfira'),
	('sergey jukov'),
	('butusov'),
	('viktor coi'),
	('kirkorov'),
	('baskov'),
	('lechenko'),
	('niletto'),
	('элджей'),
	('feduk'),
	('монеточка'),
	('МакSим'),
	('Artik & Asti'),
	('Тима Белорусских');

-- 5 жанров
insert into 
	genre(name_genre)
values
	('pop'),
	('rock'),
	('jaze'),
	('rep'),
	('folk'),
	('hip-hop');

--8 альбомов
insert into 
	albom(name_albom, year_of_publication)
values
	('zemfira', 1999),
	('black albom', 1990),
	('Sayonara Boy', 2018),
	('Без тормозов', 1999),
	('wings', 1996),
	('gorgorod', 2011),
	('Раскраски для взрослых', 2018),
	('Твой первый диск - моя кассета', 2019),
	('Миллениум', 2021),
	('Мой рай', 2007);

-- 15 треков
insert into 
	track(name_track, albom_id, duration)
values
	('почему', 1, 230),
	('ариведерчи', 1, 164),
	('кончится лето', 2, 301),
	('следи за собой', 2, 346),
	('я не отдам тебя ни кому', 4, 339),
	('лучший парень', 4, 258),
	('дыхание', 5, 339),
	('минимал', 3, 203),
	('где нас нет', 5, 266),
	('ночной ларек', 6, 164),
	('витаминка', 7, 176),
	('руферы', 7, 191),
	('истеричка', 8, 224),	
	('Миллениум', 8, 200),
	('Мой рай', 9, 216);

-- 8 сборников
insert into 
	collection(name_collection, year_of_issue)
values
	('рок', 2000),
	('танцевальная музыка', 2010),
	('для души', 2015),
	('хиты', 2020),
	('дискотека 90-00', 2017),
	('медляк', 2021),
	('вечеринка', 2021),
	('в дорогу', 2018);

-- insert artist_genre
insert into 
	artist_genre(artist_id, genre_id)
values
	(1, 4),
	(1, 6),
	(2, 2),
	(3, 1),
	(3, 6),
	(4, 2),
	(5, 2),
	(6, 1),
	(6, 6),
	(7, 1),
	(7, 6),
	(8, 1),
	(8, 5),
	(9, 1),
	(9, 4),
	(9, 6),
	(10, 4),
	(10, 6),
	(11, 4),
	(11, 6),
	(12, 1),
	(13, 1),
	(14, 1),
	(15, 1);

-- insert artist_albom
insert into 
	artist_albom(artist_id, albom_id)
values
	(1, 5),
	(2, 1),
	(3, 10),
	(4, 4),
	(5, 2),
	(15, 9),
	(14, 7),
	(12, 6),
	(10, 3),
	(13, 8);

-- insert track_collection
insert into 
	track_collection(track_id, collection_id)
values
	(1, 1),
	(1, 3),
	(2, 1),
	(2, 3),
	(2, 8),
	(3, 1),
	(3, 8),
	(4, 1),
	(4, 3),
	(4, 8),
	(5, 2),
	(5, 5),
	(5, 6),
	(6, 2),
	(6, 5),
	(7, 1),
	(7, 3),
	(7, 8),
	(8, 2),
	(8, 4),
	(8, 7),
	(9, 3),
	(9, 8),
	(10, 3),
	(10, 8),
	(11, 2),
	(11, 4),
	(11, 7),
	(12, 2),
	(12, 4),
	(12, 7),
	(13, 2),
	(13, 4),
	(13, 7),
	(15, 6);